app/controllers/admin/products_controller.rb

	def create
		@product_new = Product.new(product_params)
		@product_new.save
---
INSERT INTO "products" ("title", "image_id", "price", "label", "stock", "release", "introduction", "artist_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)