app/controllers/public/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@categories = Category.all.order(category_name: "ASC")
	    @artists = Artist.all.order(artist_name: "ASC")
	    @animes = Anime.all.order(anime_kana: "ASC")
		@product = Product.find(params[:id])