app/controllers/artists_controller.rb

INSERT INTO "artists" ("artist_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["artist_name", "q"], ["created_at", "2018-10-13 11:57:07.756401"], ["updated_at", "2018-10-13 11:57:07.756401"]]
---
  def create
    @artist_new = Artist.new(artist_params)
    if @artist_new.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @artist_edit = Artist.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "artists" SET "artist_name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["artist_name", "w"], ["updated_at", "2018-10-13 11:58:31.887207"], ["id", 1]]
---
  def update
    @artist_edit = Artist.find(params[:id])
    if @artist_edit.update(artist_params)