app/controllers/categories_controller.rb

UPDATE "categories" SET "category_name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["category_name", "2"], ["updated_at", "2018-10-13 12:11:52.145639"], ["id", 2]]
---
  def create
  	@category_new = Category.save(category_params)