app/views/admin/users/show.html.erb

SELECT "artists".* FROM "artists"
SELECT "categories".* FROM "categories"
---
	<p>アーティスト名</p>
	<%= f.select :artist_id, Artist.all.map{|u| [u.artist_name, u.id]}, include_blank: true %>
	<p>カテゴリー</p>
	<%= f.collection_check_boxes(:category_id, Category.all, :id, :name) do |b| %>